<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>14.5. Enkódování s x264 kodekem</title><link rel="stylesheet" href="default.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.68.1"><link rel="start" href="index.html" title="MPlayer - Multimediální p&#345;ehráva&#269;"><link rel="up" href="encoding-guide.html" title="Kapitola 14. Enkódování s MEncoderem"><link rel="prev" href="menc-feat-xvid.html" title="14.4. Enkódování pomocí kodeku XviD
"><link rel="next" href="menc-feat-video-for-windows.html" title="14.6. Enkódování rodinou kodek&#367; Video For Windows"><link rel="preface" href="howtoread.html" title="Jak &#269;íst tuto  dokumentaci"><link rel="chapter" href="intro.html" title="Kapitola 1. P&#345;edstavení"><link rel="chapter" href="install.html" title="Kapitola 2. Instalace"><link rel="chapter" href="usage.html" title="Kapitola 3. Pou&#382;ití"><link rel="chapter" href="cd-dvd.html" title="Kapitola 4. Pou&#382;ití CD/DVD"><link rel="chapter" href="faq.html" title="Kapitola 5. &#268;asto Kladené Dotazy (FAQ)"><link rel="chapter" href="containers.html" title="Kapitola 6. Nosné formáty (Containers)"><link rel="chapter" href="codecs.html" title="Kapitola 7. Kodeky"><link rel="chapter" href="video.html" title="Kapitola 8. Výstupní video za&#345;ízení/rozhraní"><link rel="chapter" href="audio.html" title="Kapitola 9. Výstupní zvuková za&#345;ízení"><link rel="chapter" href="tv.html" title="Kapitola 10. TV"><link rel="chapter" href="radio.html" title="Kapitola 11. Rádio"><link rel="chapter" href="ports.html" title="Kapitola 12. Porty"><link rel="chapter" href="mencoder.html" title="Kapitola 13. Základní pou&#382;ití MEncoderu"><link rel="chapter" href="encoding-guide.html" title="Kapitola 14. Enkódování s MEncoderem"><link rel="appendix" href="bugreports.html" title="P&#345;íloha A. Jak hlásit chyby"><link rel="appendix" href="bugs.html" title="P&#345;íloha B. Známé chyby"><link rel="appendix" href="skin.html" title="P&#345;íloha C. Formát skin&#367; MPlayeru"><link rel="subsection" href="menc-feat-x264.html#menc-feat-x264-encoding-options" title="14.5.1. Enkódovací volby x264"><link rel="subsection" href="menc-feat-x264.html#menc-feat-x264-example-settings" title="14.5.2. P&#345;íklady nastavení enkódování"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">14.5. Enkódování s <code class="systemitem">x264</code> kodekem</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="menc-feat-xvid.html">P&#345;edcházející</a> </td><th width="60%" align="center">Kapitola 14. Enkódování s <span class="application">MEncoder</span>em</th><td width="20%" align="right"> <a accesskey="n" href="menc-feat-video-for-windows.html">Dal&#353;í</a></td></tr></table><hr></div><div class="sect1" lang="cs"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="menc-feat-x264"></a>14.5. Enkódování s <code class="systemitem">x264</code> kodekem</h2></div></div></div><p>
  <code class="systemitem">x264</code> je svobodná knihovna pro
  enkódování H.264/AVC video proud&#367;.
  P&#345;e zahájením enkódování budete muset <a href="video-codecs.html#codec-x264-encode" title="7.1.9.4. Jak mohu enkódovat video pomocí MEncoder a x264?">
  nastavit její podporu v <span class="application">MEncoder</span>u</a>.
</p><div class="sect2" lang="cs"><div class="titlepage"><div><div><h3 class="title"><a name="menc-feat-x264-encoding-options"></a>14.5.1. Enkódovací volby x264</h3></div></div></div><p>
  Za&#269;n&#283;te prosím prohlídkou sekce
  <code class="systemitem">x264</code> man stránky
  <span class="application">MPlayer</span>u.
  Tato sekce je zamý&#353;lena jako dopln&#283;k nam stránky.
  Zde naleznete tipy, které volby budou nejspí&#353;e zajímat v&#283;t&#353;inu lidí.
  Man stránka je více uhlazená, ale také více vy&#269;erpávající a
  ob&#269;as nabízí mnohem lep&#353;í technické detaily.
</p><div class="sect3" lang="cs"><div class="titlepage"><div><div><h4 class="title"><a name="menc-feat-x264-encoding-options-intro"></a>14.5.1.1. Úvodem</h4></div></div></div><p>Tato p&#345;íru&#269;ka pokrývá dv&#283; hlavní kategorie enkódovacích voleb:</p><div class="orderedlist"><ol type="1"><li><p>Volby které m&#283;ní dobu enkódování za kvalitu
  </p></li><li><p>Volby které mohou být pou&#382;itelné pro napln&#283;ní r&#367;zných
  osobních preferencí a speciálních po&#382;adavk&#367;</p></li></ol></div><p>
  Nakonec jen vy m&#367;&#382;ete rozhodnout, které volby jsou nejlep&#353;í pro
  va&#353;e ú&#269;ely. Rozhodování v první kategorii voleb je nejjednodu&#353;&#353;í:
  sta&#269;í kdy&#382; zhodnotíte zda zm&#283;ny kvality ospravedlní rychlostní rozdíly.
  Druhá skupina voleb m&#367;&#382;e být mnohem subjektivn&#283;j&#353;í zále&#382;itostí a
  v úvahu m&#367;&#382;e p&#345;ijít více faktor&#367;. Poznamenejme, &#382;e n&#283;které volby
  "osobních preferencí a speciálních po&#382;adavk&#367;" mohou také zna&#269;n&#283;
  ovlivnit kvalitu nebo rychlost enkódování, ale to není jejich hlavní funkce.
  N&#283;kolik voleb "osobních preferencí" m&#367;&#382;e dokonce zp&#367;sobit zm&#283;ny,
  po kterých se n&#283;komu zdá být výsledek lep&#353;í a jinému hor&#353;í.
</p><p>
  Ne&#382; budeme pokra&#269;ovat, poznamenejme, &#382;e tento návod pou&#382;ívá jediné m&#283;&#345;ítko
  kvality: celkový PSNR.
  Stru&#269;né vysv&#283;tlení co je to PSNR, naleznete
  <a href="http://en.wikipedia.org/wiki/PSNR" target="_top">ve Wikipedii pod heslem PSNR</a>.
  Celkové PSNR je poslední hlá&#353;ené PSNR &#269;íslo p&#345;i za&#345;azení volby
  <tt class="option">psnr</tt> v <tt class="option">x264encopts</tt>.
  Kdykoli pí&#353;eme o PSNR, je jedním z p&#345;edpoklad&#367; tohoto sd&#283;lení
  to, &#382;e jsou pou&#382;ity shodné datové toky.
</p><p>
  Tém&#283;&#345; v&#353;echny komentá&#345;e v tomto návodu p&#345;edpokládají, &#382;e enkódujete
  dvoupr&#367;chodov&#283;.
  P&#345;i porovnávání voleb jsou zde dva hlavní d&#367;vody pro pou&#382;ití dvoupr&#367;chodového
  enkódování.
  Zaprvé, dvoupr&#367;chodové enkódování vám získá zhruba 1dB PSNR, co&#382; je
  znatelný rozdíl.
  Zadruhé, testování voleb pomocí p&#345;ímého porovnání kvality v jednopr&#367;chodových
  výsledcích je pochybné, jeliko&#382; se datový tok zna&#269;n&#283; li&#353;í s ka&#382;dým
  enkódováním.
  Není v&#382;dy snadné ur&#269;it, zda se zm&#283;nila kvalita díky zm&#283;n&#283; voleb, nebo
  z v&#283;t&#353;í &#269;ásti odpovídají zm&#283;nám datového toku.
</p></div><div class="sect3" lang="cs"><div class="titlepage"><div><div><h4 class="title"><a name="menc-feat-x264-encoding-options-speedvquality"></a>14.5.1.2. Volby které primárn&#283; ovliv&#328;ují rychlost a kvalitu</h4></div></div></div><div class="itemizedlist"><ul type="disc"><li><p>
  <span class="bold"><strong>subq</strong></span>:
  Z voleb, které umo&#382;&#328;ují vym&#283;nit &#269;as za kvalitu, jsou obvykle nejd&#367;le&#382;it&#283;j&#353;í
  <tt class="option">subq</tt> a <tt class="option">frameref</tt> (viz ní&#382;e).
  Máte-li zájem ovlivnit jak rychlost, tak kvalitu, jsou to první volby,
  které byste m&#283;li zvá&#382;it.
  Ve smyslu rychlosti se spolu volby <tt class="option">frameref</tt> a
  <tt class="option">subq</tt> velmi siln&#283; ovliv&#328;ují.
  Zku&#353;enosti ukazují, &#382;e p&#345;i jednom referen&#269;ním snímku si
  <tt class="option">subq=5</tt> vezme asi o 35% více &#269;asu ne&#382;
  <tt class="option">subq=1</tt>.
  P&#345;i 6 referen&#269;ních snímcích naroste spomalení nad 60%.
  Vliv <tt class="option">subq</tt> na PSNR se zdá být pom&#283;rn&#283; stálý,
  bez ohledu na po&#269;et referen&#269;ních snímk&#367;.
  Typicky <tt class="option">subq=5</tt> získá 0.2-0.5 dB
  celkového PSNR p&#345;es <tt class="option">subq=1</tt>.
  To je obvykle ji&#382; viditelné.
</p><p>
  Re&#382;im <tt class="option">subq=6</tt> je nejpomalej&#353;í s nejvy&#353;&#353;í kvalitou.
  Oproti <tt class="option">subq=5</tt> obvykle získává 0.1-0.4 dB
  celkového PSNR za cenu ztráty rychlosti 25%-100%.
  Narozdíl od ostatních úrovní <tt class="option">subq</tt> nezávisí chování
  <tt class="option">subq=6</tt> tolik na <tt class="option">frameref</tt>
  a <tt class="option">me</tt>. Místo toho závisí efektivita <tt class="option">subq=6
  </tt> hlavn&#283; na po&#269;tu pou&#382;itých B-snímk&#367;. P&#345;i b&#283;&#382;ném pou&#382;ití
  to znamená, &#382;e <tt class="option">subq=6</tt> má velký vliv jak na rychlost, tak na
  kvalitu v komplexních, velmi pohyblivých scénách, ale nemusí mít takový vliv
  ve scénách s malým pohybem. Poznamenejme, &#382;e stále doporu&#269;ujeme nastavit
  <tt class="option">bframes</tt> na nenulovou hodnotu (viz ní&#382;e).
</p></li><li><p>
  <span class="bold"><strong>frameref</strong></span>:
  Výchozí nastavení <tt class="option">frameref</tt> je 1, ale nem&#283;lo by to být bráno
  tak, &#382;e je rozumné nastavovat jej na 1.
  Pouhé zvý&#353;ení <tt class="option">frameref</tt> na 2 získá okolo
  0.15dB PSNR s 5-10% spomalením, co&#382; je z&#345;ejm&#283; dobrý obchod.
  <tt class="option">frameref=3</tt> získá kolem 0.25dB PSNR navíc k
  <tt class="option">frameref=1</tt>, co&#382; ji&#382; m&#367;&#382;e být viditelný
  rozdíl.
  <tt class="option">frameref=3</tt> je asi o 15% pomalej&#353;í ne&#382;
  <tt class="option">frameref=1</tt>.
  Nane&#353;t&#283;stí se zisk rychle vytrácí.
  Pr&#345; <tt class="option">frameref=6</tt> m&#367;&#382;ete o&#269;ekávat zisk pouze
  0.05-0.1 dB nad <tt class="option">frameref=3</tt> p&#345;i dodate&#269;ném
  15% zpomalení.
  Nad <tt class="option">frameref=6</tt> je zisk kvality obvykle velmi malý
  (a&#269;koli byste m&#283;li mít na pam&#283;ti, &#382;e se to m&#367;&#382;e výrazn&#283; li&#353;it v závislosti
  na zdrojovém materiálu).
  V pom&#283;rn&#283; typickém p&#345;ípad&#283; zlep&#353;í <tt class="option">frameref=12</tt>
  celkový PSNR o pouhé 0.02dB nad <tt class="option">frameref=6</tt>,
  p&#345;i spomalení o 15%-20%.
  P&#345;i tak vysokých hodnotách <tt class="option">frameref</tt> lze &#345;íct pouze
  jedinou dobrou v&#283;c, a to &#382;e jejich dal&#353;í zvy&#353;ování tém&#283;&#345; nikdy
  <span class="bold"><strong>nesní&#382;í</strong></span> PSNR, ale dal&#353;í zisk kvality
  je st&#283;&#382;í m&#283;&#345;itelný, nato&#382; viditelný.
</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">Poznámka:</h3><p>
  Zvý&#353;ení <tt class="option">frameref</tt> na nemístn&#283; vysokou hodnotu
  <span class="bold"><strong>m&#367;&#382;e</strong></span> a
  <span class="bold"><strong>obvykle taky sní&#382;í</strong></span>
  efektivitu kódování, pokud vypnete CABAC.
  Se zapnutým CABAC (výchozí chování) se zdá být mo&#382;nost nastavit
  <tt class="option">frameref</tt> "p&#345;íli&#353; vysoko" p&#345;íli&#353; vzdálená na to,
  abyste se tím museli trápit a v budoucnu mohou optimalizace
  tuto mo&#382;nost zcela vylou&#269;it.
</p></div><p>
  Pokud vám zále&#382;í na rychlosti, bývá vhodným kompromisem pou&#382;ít
  nízké hodnoty <tt class="option">subq</tt> a <tt class="option">frameref</tt>
  v prvním pr&#367;chodu a zvý&#353;it je ve druhém.
  Typicky to má zanedbatelný záporný vliv na kone&#269;nou kvalitu:
  Pravd&#283;podobn&#283; stratíte mén&#283; ne&#382; 0.1dB PSNR, co&#382; by m&#283;l být a&#382; p&#345;íli&#353;
  malý rozdíl, ne&#382; aby byl vid&#283;t.
  Odli&#353;né hodnoty <tt class="option">frameref</tt> v&#353;ak mohou místy ovlivnit
  volbu typu snímku.
  Nejspí&#353; to budou ojedin&#283;lé p&#345;ípady, ale chcete-li si být zcela jisti,
  zjist&#283;te, jestli va&#353;e video obsahuje bu&#271; blýskavé vzory p&#345;es celou obrazovku,
  nebo rozsáhlé krátkodobé zm&#283;ny, které by mohly vynutit I-snímek.
  Nastavte <tt class="option">frameref</tt> pro první pr&#367;chod tak, aby byl
  dostate&#269;n&#283; velký pro pokrytí doby bliknutí (nebo zm&#283;ny).
  Nap&#345;íklad, pokud scéna p&#345;epíná tam a zp&#283;t mezi dv&#283;ma obrázky p&#345;es t&#345;i snímky,
  nastavte <tt class="option">frameref</tt> pro první pr&#367;chod na 3 a více.
  Tento p&#345;ípad je nejspí&#353; zcela ojedin&#283;lý v hraných filmech, ale ob&#269;as se
  vyskytuje v záznamech z videoher.
</p></li><li><p>
  <span class="bold"><strong>me</strong></span>:
  Tato volba je ur&#269;ena pro výb&#283;r metody vyhledávání pohybu.
  Zm&#283;nou této volby jednodu&#353;e m&#283;níte pom&#283;r kvalita-versus-rychlost.
  Volba <tt class="option">me=1</tt> je jen o málo procent rychlej&#353;í ne&#382;
  výchozí vyhledávání za cenu pod 0.1dB globálního PSNR.
  Výchozí nastavení (<tt class="option">me=2</tt>) je rozumným kompromisem
  mezi rychlostí a kvalitou. Volba <tt class="option">me=3</tt> získá o tro&#353;ku mén&#283;
  ne&#382; 0.1dB globální PSNR, p&#345;i spomalení, které se li&#353;í v závislosti na
  <tt class="option">frameref</tt>.  P&#345;i vysokých hodnotách
  <tt class="option">frameref</tt> (&#345;ekn&#283;me 12 nebo tak), je <tt class="option">me=3</tt>
  asi o 40% pomalej&#353;í ne&#382; výchozí <tt class="option"> me=2</tt>. P&#345;i
  <tt class="option">frameref=3</tt>, klesne zp&#367;sobené spomalení na
  25%-30%.
</p><p>
  Volba <tt class="option">me=4</tt> pou&#382;ívá tak rozsáhlé vyhledávání, &#382;e je p&#345;íli&#353;
  pomalá pro praktické vyu&#382;ití.
</p></li><li><p>
  <span class="bold"><strong>4x4mv</strong></span>:
  Tato volba zapíná pou&#382;ití pod&#269;ástí 8x4, 4x8 a 4x4 v predikovaných
  makroblocích. Její aktivace vede k pom&#283;rn&#283; stálé 
  10%-15% ztrát&#283; rychlosti. Tato volba je pom&#283;rn&#283; neu&#382;ite&#269;ná ve zdroji
  obsahujícím pouze pomalý pohyb, naproti tomu u n&#283;kterých zdroj&#367; s rychlým
  pohybem, p&#345;esn&#283;ji zdroj&#367; s velkým mno&#382;stvím malých pohyblivých objekt&#367;,
  m&#367;&#382;ete o&#269;ekávat zisk okolo 0.1dB.
</p></li><li><p>
  <span class="bold"><strong>bframes</strong></span>:
  Pou&#382;itelnost B-snímk&#367; je ve v&#283;t&#353;in&#283; ostatních kodek&#367; diskutabilní.
  V H.264 se to zm&#283;nilo: jsou zde nové techniky a typy blok&#367; pro pou&#382;ití
  v B-snímcích.
  Obvykle i naivní algoritmus pro výb&#283;r B-snímku m&#367;&#382;e zajistit znatelný
  zisk PSNR.
  Také je zajímavé, &#382;e pokud vypnete adaptivní rozhodování o B-snímku
  (<tt class="option">nob_adapt</tt>), zvý&#353;í obvykle enkódování s
  <tt class="option">bframes</tt> o trochu rychlost enkódování.
</p><p>
  S vypnutým adaptivním rozhodováním o B-snímku
  (<tt class="option">x264encopts</tt> - volba <tt class="option">nob_adapt</tt>),
  optimální hodnota tohoto nastavení nebývá obvykle vy&#353;&#353;í ne&#382;
  <tt class="option">bframes=1</tt>, jinak mouhou utrp&#283;t velmi pohyblivé scény.
  Se zapnutým adaptivním rozhodováním o B-snímku (výchozí chování),
  je obvykle bezpe&#269;né pou&#382;ít vy&#353;&#353;í hodnoty; enkodér se pokusí sní&#382;it
  pou&#382;ití B-snímk&#367; ve scénách, kde by sní&#382;ily kompresi.
  Enkodér z&#345;ídka pou&#382;ije více ne&#382; 3 nebo 4 B-snímky;
  nastavení této volby na vy&#353;&#353;í hodnotu bude mít jen nepatrný vliv.
</p></li><li><p>
  <span class="bold"><strong>b_adapt</strong></span>:
  Poznámka: Výchozí je zapnuto.
</p><p>
  Je-li tato volba zapnuta, bude enkodér pou&#382;ívat rychlou
  heuristiku pro sní&#382;ení po&#269;tu B-snímk&#367; ve scénách, kde by jejich
  pou&#382;itím p&#345;íli&#353; nezískaly.
  M&#367;&#382;ete pou&#382;ít <tt class="option">b_bias</tt> pro nastavení jak p&#345;átelský
  bude enkodér k B-snímk&#367;m.
  Spomalení p&#367;sobené adaptivními B-snímky je nyní spí&#353;e malé, ale
  stejn&#283; tak potenciální zisk kvality.
  Obvykle v&#353;ak nijak ne&#353;kodí.
  Poznamenejme, &#382;e ovliv&#328;uje rychlost a rozhodování o typu snímku pouze
  v prvním pr&#367;chodu.
  <tt class="option">b_adapt</tt> a <tt class="option">b_bias</tt> nemají &#382;ádný vliv
  v následných pr&#367;chodech.
</p></li><li><p>
  <span class="bold"><strong>b_pyramid</strong></span>:
  Pokud pou&#382;íváte &gt;=2 B-snímky, m&#367;&#382;ete také zapnout tuto volbu; jak
  &#345;íká man stránka, dostanete malé zvý&#353;ení kvality bez ztráty rychlosti.
  Poznamenejme, &#382;e tato videa nelze &#269;íst dekodéry zalo&#382;enými na libavcodec
  star&#353;ími ne&#382; 5. b&#345;ezna 2005.
</p></li><li><p>
  <span class="bold"><strong>weight_b</strong></span>:
  V typických p&#345;ípadech tato volba nep&#345;iná&#353;í velký zisk.
  V prolínacích nebo stmívacích scénách v&#353;ak vá&#382;ená predikce
  umo&#382;&#328;uje pom&#283;rn&#283; velkou úsporu datového toku.
  V MPEG-4 ASP bývá stmívání obvykle nejlépe kódováno jako série
  velkých I-snímk&#367;; pou&#382;ití vá&#382;ené predikce v B-snímcích umo&#382;&#328;uje
  zm&#283;nit alespo&#328; n&#283;které z nich na rozumn&#283; men&#353;í B-snímky.
  Spomalení enkódování se zdá být minimální, pokud n&#283;jaké je.
  Rovn&#283;&#382;, v rozporu s tím, co si n&#283;kte&#345;í lidé mohou myslet,
  po&#382;adavky dekodéru na CPU nejsou vá&#382;enou predikcí ovlivn&#283;ny,
  ostatní mo&#382;nosti jsou stejn&#283; náro&#269;né.
</p><p>
  Nane&#353;t&#283;stí má aktuáln&#283; algoritmus adaptivního rozhodování o B-snímcích
  výraznou tendenci vyvarovat se B-snímk&#367; p&#345;i stmívání.
  Dokud se to nezm&#283;ní, bude dobré p&#345;idat
  <tt class="option">nob_adapt</tt> do x264encopts, pokud o&#269;ekáváte, &#382;e stmívání
  bude mít znatelný vliv ve va&#353;em konkrétním klipu.
</p></li></ul></div></div><div class="sect3" lang="cs"><div class="titlepage"><div><div><h4 class="title"><a name="menc-feat-x264-encoding-options-misc-preferences"></a>14.5.1.3. Volby nále&#382;ející r&#367;zným preferencím</h4></div></div></div><div class="itemizedlist"><ul type="disc"><li><p>
  <span class="bold"><strong>Dvoupr&#367;chodové enkodování</strong></span>:
  Vý&#353;e jsme doporu&#269;ovali v&#382;dy pou&#382;ívat dvoupr&#367;chodové enkódování, ale
  stále existují d&#367;vody pro&#269; jej nepou&#382;ít. Nap&#345;íklad pokud zachytáváte
  TV vysílání a enkódujete v reálném &#269;ase, nemáte jinou mo&#382;nost, ne&#382;
  pou&#382;ít jeden pr&#367;chod. Jeden pr&#367;chod je samoz&#345;ejm&#283; rychlej&#353;í
  ne&#382; dva; pokud pou&#382;ijete stejné volby v obou pr&#367;chodech, pak je dvoupr&#367;chodové
  enkódování tém&#283;&#345; dvakrát pomalej&#353;í.
</p><p>
  Stále jsou v&#353;ak velmi dobré d&#367;vody pro pou&#382;ití dvoupr&#367;chodového re&#382;imu.
  Voli&#269; datového toku v jednopr&#367;chodovém re&#382;imu není odu&#353;evn&#283;lý a &#269;asto
  d&#283;lá nerozumné volby, proto&#382;e nevidí celkový obraz. P&#345;edpokládejme, &#382;e
  máte nap&#345;íklad dvouminutové video skládající se ze dvou &#269;ástí.
  První polovina je vysoce pohyblivá scéna dlouhá 60 sekund, která samostatn&#283;
  vy&#382;aduje kolem 2500kbps, aby vypadala slu&#353;n&#283;.
  Hned za ní následuje mén&#283; náro&#269;ná 60 sekundová scéna, která vypadá dob&#345;e
  p&#345;i 300kbps. Vy&#382;ádáte si 1400kbps, co&#382; je teoreticky dostate&#269;né pro pokrytí
  obou scén. Jednopr&#367;chodový voli&#269; datového toku v tom p&#345;ípad&#283; u&#269;iní
  n&#283;kolik "chyb". První blok m&#367;&#382;e skon&#269;it t&#283;&#382;ce p&#345;ekvantizovaný, tak&#382;e
  bude nepou&#382;iteln&#283; a zbyte&#269;n&#283; &#269;tvere&#269;kovaný. Druhá &#269;ást bude velmi
  podkvantizovaná; to m&#367;&#382;e vypadat dob&#345;e, ale spot&#345;eba bit&#367; na tento
  vzhled je nerozumn&#283; vysoká. &#268;eho se dá je&#353;t&#283; h&#367;&#345;e vyvarovat je problém
  p&#345;echodu mezi t&#283;mito scénami. První sekundy málo pohyblivé poloviny
  budou t&#283;&#382;ce p&#345;ekvantizovány, proto&#382;e voli&#269; toku stále o&#269;ekává nároky na
  datový tok, se kterými se potýkal v první polovin&#283; videa.
  Tato "chybová doba" p&#345;ekvantizované málo pohyblivé scény bude vypadat
  neskute&#269;n&#283; &#353;patn&#283; a skute&#269;n&#283; pou&#382;ije mén&#283; ne&#382; 300kbps, které by pot&#345;ebovala,
  aby vypadala dob&#345;e. Existují zp&#367;soby pro zmírn&#283;ní nástrah jednopr&#367;chodového
  enkódování, ale ty mohou tíhnout ke zvy&#353;ování nep&#345;esnosti datového toku.
</p><p>
  Vícepr&#367;chodový voli&#269; datového toku nabízí velké výhody oproti jednomu
  pr&#367;chodu. Díky statistikám generovaným v prvním pr&#367;chodu m&#367;&#382;e enkodér
  ur&#269;it, s rozumnou p&#345;esností, bitovou náro&#269;nost enkódování ka&#382;dého snímku
  p&#345;i jakémkoli kvantizéru. To umo&#382;&#328;uje mnohem racionáln&#283;j&#353;í, lépe naplánovanou
  spot&#345;ebu bit&#367; mezi drahými (hodn&#283; pohyblivými) a levnými (málo pohyblivými)
  scénami. N&#283;kolik nápad&#367; jak upravit tuto spot&#345;ebu podle svého naleznete ní&#382;e
  viz <tt class="option">qcomp</tt>.
</p><p>
  Navíc dva pr&#367;chody nemusí trvat dvakrát tak dlouho jako jeden. M&#367;&#382;ete upravit
  volby prvního pr&#367;chodu pro nejvy&#353;&#353;í rychlost a ni&#382;&#353;í kvalitu.
  Pokud si dob&#345;e zvolíte své volby, m&#367;&#382;ete mít velmi rychlý první pr&#367;chod.
  Výsledná kvalita  ve druhém pr&#367;chodu bude trochu hor&#353;í, proto&#382;e predikce
  velikosti je mén&#283; p&#345;esná, ale rozdíl v kvalit&#283; je obvykle p&#345;íli&#382; malý, aby
  byl vid&#283;t. Zkuste nap&#345;. p&#345;idat
  <tt class="option">subq=1:frameref=1</tt> do <tt class="option">x264encopts</tt>
  prvnímu pr&#367;chodu. Pak ve druhém pr&#367;chodu pou&#382;ijte pomalej&#353;í volby pro
  vy&#353;&#353;í kvalitu:
  <tt class="option">subq=6:frameref=15:4x4mv:me=3</tt>
</p></li><li><p>
  <span class="bold"><strong>T&#345;ípr&#367;chodové enkódování</strong></span>?

  x264 nabízí mo&#382;nost provád&#283;t v&#283;t&#353;í po&#269;et následných pr&#367;chod&#367;.
  Pokud zadáte <tt class="option">pass=1</tt> v prvním pr&#367;chodu a pak pou&#382;ijete
  <tt class="option">pass=3</tt> v následujícím pr&#367;chodu, pak tento pr&#367;chod
  jak na&#269;te statistiky z p&#345;edchozího, tak zapí&#353;e své vlastní. Dal&#353;í pr&#367;chod
  po n&#283;m pak bude mít velmi dobrou základnu pro vysoce p&#345;esnou predikci
  velikosti snímk&#367; p&#345;i zvoleném kvantizéru. V praxi se celková kvalita
  z toho vze&#353;lá blí&#382;í nule a je mo&#382;né, &#382;e t&#345;etí pr&#367;chod bude mít hor&#353;í
  celkový PSNR ne&#382; jeho p&#345;edchúdce. P&#345;i b&#283;&#382;ném pou&#382;ití t&#345;i pr&#367;chody pom&#367;&#382;ou,
  pokud dostanete bu&#271; &#353;patnou predikci datového toku, nebo &#353;patn&#283; vypadající
  p&#345;echody mezi scénami po pou&#382;ití pouze dvou pr&#367;chod&#367;.
  To se nejspí&#353; m&#367;&#382;e stát v extrémn&#283; krátkých klipech. Je rovn&#283;&#382; n&#283;kolik
  zvlá&#353;tních p&#345;ípad&#367;, ve kterých jsou t&#345;i a více pr&#367;chod&#367; dobré pro
  pokro&#269;ilé u&#382;ivatele, ale pro stru&#269;nost se zde t&#283;mito p&#345;ípady zabývat nebudeme.

</p></li><li><p>
  <span class="bold"><strong>qcomp</strong></span>:
  <tt class="option">qcomp</tt> m&#283;ní pom&#283;r po&#269;tu bit&#367; alokovaných "drahým"
  velmi pohyblivým snímk&#367;m k "levným" málo pohyblivým snímk&#367;m. V jednom
  extrému, <tt class="option">qcomp=0</tt> vede k &#269;ist&#283; konstantnímu datovému toku.
  Co&#382; typicky &#269;iní velmi pohyblivé scény velmi o&#353;klivé, zatímco scény
  s malým pohybem vypadají perfektn&#283;, ale spot&#345;ebovávají mnohem v&#283;t&#353;í datový
  tok, ne&#382; by pot&#345;ebovaly k tomu, aby je&#353;t&#283; vypadaly skv&#283;le.
  Ve druhém extrému, <tt class="option">qcomp=1</tt>, dostanete tém&#283;&#345; konstantní
  kvantiza&#269;ní parametr (QP). Konstantní QP nevypadá &#353;patn&#283;, ale v&#283;t&#353;ina
  lidí soudí, &#382;e je rozumn&#283;j&#353;í sní&#382;it trochu datový tok v extrémn&#283;
  náro&#269;ných scénách (kde sní&#382;ení kvality není tak vid&#283;t) a realokovat je
  do scén, které je snadn&#283;j&#353;í enkódovat p&#345;i excelentní kvalit&#283;.
  Výchozí hodnota <tt class="option">qcomp</tt> je 0.6, co&#382; m&#367;&#382;e být, podle
  n&#283;kterých lidí pon&#283;kud málo (b&#283;&#382;n&#283; se rovn&#283;&#382; pou&#382;ívá 0.7-0.8).
</p></li><li><p>
  <span class="bold"><strong>keyint</strong></span>:
  <tt class="option">keyint</tt> je výhradn&#283; pro vým&#283;nu míry p&#345;evinutelnosti
  za efektivitu kódování. Výchozí hodnota <tt class="option">keyint</tt> je 250.
  V materiálu 25 snímk&#367; za sekundu to zaji&#353;&#357;uje schopnost p&#345;evíjení
  s 10 sekundovou p&#345;esností. Pokud soudíte, &#382;e bude d&#367;le&#382;ité a u&#382;ite&#269;né
  být schopen p&#345;evíjet s p&#345;esností 5 sekund, nastavte
  <tt class="option">keyint=125</tt>;
  to ov&#353;em trochu sní&#382;í kvalitu/datový tok. Pokud vám jde jen o kvalitu, nikoli
  p&#345;evinutelnost, m&#367;&#382;ete si nastavit mnohem vy&#353;&#353;í hodnoty
  (rozum&#283;jte &#382;e zisk z toho klesá a m&#367;&#382;e být neznatelný a&#382; &#382;ádný).
  Video proud bude stále mít p&#345;evíjecí body, pokud jsou zde n&#283;jaké zm&#283;ny scény.
</p></li><li><p>
  <span class="bold"><strong>deblockalpha, deblockbeta</strong></span>:
  Tato v&#283;c za&#269;íná být trochu kontroverzní.
</p><p>
  H.264 definuje jednoduchou deblokovací proceduru I-blok&#367;, která pou&#382;ívá
  p&#345;ednastavených sil a prah&#367; závislých na QP daného bloku.
  Výchozí je, &#382;e bloky s vysokým QP jsou filtrovány siln&#283; a bloky s nízkým QP
  nejsou deblokovány v&#367;bec.
  P&#345;ednastavené síly definované standardem jsou dob&#345;e zvoleny a
  vyvá&#382;eny tak, &#382;e jsou optimální z hlediska PSNR pro libovolné
  video, které zkou&#353;íte enkódovat.
  Volby <tt class="option">deblockalpha</tt> a <tt class="option">deblockbeta</tt>
  umo&#382;&#328;ují nastavit offsety p&#345;ednastaveným deblokovacím prah&#367;m.
</p><p>
  Zdá se, &#382;e si mnoho lidí myslí, &#382;e je dobré sní&#382;it sílu deblokovacího filtru
  o vysokou hodnotu (&#345;ekn&#283;me, -3).
  To v&#353;ak není tém&#283;&#345; nikdy dobrý nápad a v mnoha p&#345;ípadech lidé,
  kte&#345;í to d&#283;lají, nerozumí dob&#345;e tomu, jak pracuje výchozí deblokování.
</p><p>
  První a nejd&#367;le&#382;it&#283;j&#353;í v&#283;c, kterou byste m&#283;li v&#283;d&#283;t o in-loop
  deblokovacím filtru, je, &#382;e výchozí prahy jsou tém&#283;&#345; v&#382;dy optimální
  z hlediska PSNR.
  V &#345;ídkých p&#345;ípadech, kdy nejsou, je ideální offset plusmínus 1.
  Úprava deblokovacích parametr&#367; o v&#283;t&#353;í hodnotu tém&#283;&#345; zaru&#269;en&#283;
  po&#353;kodí PSNR.
  Zesílení filtru set&#345;e více detail&#367;; oslabení filtru povede k
  zvý&#353;ené viditelnosti blokování.
</p><p>
  Rozhodn&#283; je hloupost sni&#382;ovat deblokovací prahy pokud má va&#353;e video
  p&#345;evá&#382;n&#283; nízkou plo&#353;nou komplexnost (&#269;ili málo detail&#367; nebo &#353;umu).
  In-loop filtr odvádí tém&#283;&#345; výbornou práci v ukrývání
  artefakt&#367;, které se mohou vyskytnout.
  Pokud má zdroj vysokou pl&#353;nou komplexnost, pak jsou artefakty mén&#283; viditelné.
  To proto, &#382;e krou&#382;kování vypadá podobn&#283; jako detail nebo &#353;um.
  Lidské oko snadno rozpozná, pokud je odstran&#283;n detail, ale ne
  u&#382; tak snadno pozná, &#382;e je &#353;um reprezentován &#353;patn&#283;.
  Kdy&#382; p&#345;íjde na subjektivní kvalitu, pak jsou detaily a &#353;um do jisté míry
  zam&#283;nitelné.
  Oslabením deblokovacího filtru nejspí&#353;e zvý&#353;íte chybu, p&#345;idáním
  krou&#382;kových artefakt&#367;, ale oko si toho nev&#353;imne, jeliko&#382; je zam&#283;ní
  za detaily.
</p><p>
  <span class="bold"><strong>Ani to</strong></span> v&#353;ak neospravedl&#328;uje
  oslabení deblokovacího filtru.
  Obecn&#283; dostanete kvalitn&#283;j&#353;í &#353;um pomocí postprocesingu.
  Pokud va&#353;e H.264 videa vypadají p&#345;íli&#353; neost&#345;e nebo rozmazan&#283;, zkuste si
  pohrát s <tt class="option">-vf noise</tt> p&#345;i p&#345;ehrávání.
  Volba <tt class="option">-vf noise=8a:4a</tt> by m&#283;la skrýt v&#283;t&#353;inu st&#345;edn&#283; silných
  artefakt&#367;.
  Tém&#283;&#345; ur&#269;it&#283; to bude vypadat lépe, ne&#382; výsledky, které byste mohli dosáhnout
  pohráváním si s deblokovacím filtrem.
</p></li></ul></div></div></div><div class="sect2" lang="cs"><div class="titlepage"><div><div><h3 class="title"><a name="menc-feat-x264-example-settings"></a>14.5.2. P&#345;íklady nastavení enkódování</h3></div></div></div><p>
  Následující nastavení jsou p&#345;íklady nastavení r&#367;zných kombinací voleb
  enkodéru, které ovliv&#328;ují pom&#283;r rychlost versus kvalita p&#345;i shodném
  cílovém datovém toku.
</p><p>
  Ve&#353;kerá nastavení byla testována na video vzorku 720x448 @30000/1001
  snímk&#367; za sekundu, cílový datový tok byl 900kbps a provád&#283;ly se na
  AMD-64 3400+ p&#345;i 2400 Mhz v re&#382;imu 64 bit&#367;.
  Ka&#382;dá kombinace nastavení má uvedenu zm&#283;&#345;enou rychlost enkódování
  (ve snímcích za sekundu) a ztrátu PSNR (v dB) oproti nastavení
  "velmi vysoká kvalita".
  Rozum&#283;jte v&#353;ak &#382;e, v závislosti na va&#353;em zdrojovém materiálu, typu
  po&#269;íta&#269;e a pokrok&#367;m ve vývoji, m&#367;&#382;ete dosp&#283;t k velmi odli&#353;ným výsledk&#367;m.
</p><p>
</p><div class="informaltable"><table border="1"><colgroup><col><col><col><col></colgroup><thead><tr><th>Popis</th><th>Volby</th><th>Rychlost [fps]</th><th>Relativní ztráta PSNR [dB]</th></tr></thead><tbody><tr><td>Velmi vysoká kvalita</td><td><tt class="option">subq=6:4x4mv:8x8dct:me=3:frameref=5:bframes=3:b_pyramid:weight_b</tt></td><td>6</td><td>0</td></tr><tr><td>Vysoká kvalita</td><td><tt class="option">subq=5:4x4mv:8x8dct:frameref=2:bframes=3:b_pyramid:weight_b</tt></td><td>13</td><td>-0.89</td></tr><tr><td>Rychlé enkódování</td><td><tt class="option">subq=4:bframes=2:b_pyramid:weight_b</tt></td><td>17</td><td>-1.48</td></tr></tbody></table></div><p>
</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="menc-feat-xvid.html">P&#345;edcházející</a> </td><td width="20%" align="center"><a accesskey="u" href="encoding-guide.html">Nahoru</a></td><td width="40%" align="right"> <a accesskey="n" href="menc-feat-video-for-windows.html">Dal&#353;í</a></td></tr><tr><td width="40%" align="left" valign="top">14.4. Enkódování pomocí kodeku <code class="systemitem">XviD</code>
 </td><td width="20%" align="center"><a accesskey="h" href="index.html">Dom&#367;</a></td><td width="40%" align="right" valign="top"> 14.6. Enkódování rodinou kodek&#367; <code class="systemitem">Video For Windows</code></td></tr></table></div></body></html>
