Repository: scs/uclinux
Catalog: lib/libgsasl/libgsasl-1.0/po/*.po
Languages: pl, ro

source: Libgsasl success
pl: Sukces libgsasl
ro: Succes libgsasl

source: SASL mechanism needs more data
pl: Mechanizm SASL wymagaja wiêcej danych

source: Unknown SASL mechanism
pl: Nieznany mechanizm SASL
ro: Mecanism SASL necunoscut

source: SASL mechanism called too many times
pl: Mechanizm SASL wywo³any zbyt du¿o razy
ro: Mecanism SASL apelat de prea multe ori

source: SASL function needs larger buffer (internal error)
pl: Funkcja SASL wymaga wiêkszego bufora (b³±d wewnêtrzny)

source: Could not open file in SASL library
pl: Nie mo¿na otworzyæ pliku w bibliotece SASL
ro: Nu am putut deschide fiºierul în biblioteca SASL

source: Could not close file in SASL library
pl: Nie mo¿na zamkn±æ pliku w bibliotece SASL
ro: Nu am putut închide fiºierul în biblioteca SASL

source: Memory allocation error in SASL library
pl: B³±d przydzielania pamiêci w bibliotece SASL
ro: Eroare la alocarea memoriei în biblioteca SASL

source: Base 64 coding error in SASL library
pl: B³±d kodowania base64 w bibliotece SASL
ro: Eroare encodare Base 64 în biblioteca SASL

source: Low-level crypto error in SASL library
pl: B³±d kryptografii niskiego poziomu w bibliotece SASL
ro: Eroare crypto de nivel jos în biblioteca SASL

source: SASL mechanism needs gsasl_client_callback_anonymous() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_client_callback_anonymous() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_client_callback_anonymous() (eroare aplicaþie)

source: SASL mechanism needs gsasl_client_callback_password() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_client_callback_password() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_client_callback_password() (eroare aplicaþie)

source: SASL mechanism needs gsasl_client_callback_passcode() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_client_callback_passcode() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_client_callback_passcode() (eroare aplicaþie)

source: SASL mechanism needs gsasl_client_callback_pin() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_client_callback_pin() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_client_callback_pin() (eroare aplicaþie)

source: SASL mechanism needs gsasl_client_callback_authorization_id() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_client_callback_authorization_id() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_client_callback_authorization_id() (eroare aplicaþie)

source: SASL mechanism needs gsasl_client_callback_authentication_id() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_client_callback_authentication_id() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_client_callback_authentication_id() (eroare aplicaþie)

source: SASL mechanism needs gsasl_client_callback_service() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_client_callback_service() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_client_callback_service() (eroare aplicaþie)

source: SASL mechanism needs gsasl_server_callback_validate() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_server_callback_validate() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_server_callback_validate() (eroare aplicaþie)

source: SASL mechanism needs gsasl_server_callback_cram_md5() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_server_callback_cram_md5() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_server_callback_cram_md5() (eroare aplicaþie)

source: SASL mechanism needs gsasl_server_callback_digest_md5() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_server_callback_digest_md5() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_server_callback_digest_md5() (eroare aplicaþie)

source: SASL mechanism needs gsasl_server_callback_external() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_server_callback_external() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_server_callback_external() (eroare aplicaþie)

source: SASL mechanism needs gsasl_server_callback_anonymous() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_server_callback_anonymous() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_server_callback_anonymous() (eroare aplicaþie)

source: SASL mechanism needs gsasl_server_callback_realm() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_server_callback_realm() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_server_callback_realm() (eroare aplicaþie)

source: SASL mechanism needs gsasl_server_callback_securid() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_server_callback_securid() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_server_callback_securid() (eroare aplicaþie)

source: SASL mechanism needs gsasl_server_callback_service() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_server_callback_service() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_server_callback_service() (eroare aplicaþie)

source: SASL mechanism needs gsasl_server_callback_gssapi() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_server_callback_gssapi() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_server_callback_gssapi() (eroare aplicaþie)

source: SASL mechanism needs gsasl_server_callback_retrieve() callback (application error)
pl: Mechanizm SASL wymaga wywo³ania zwrotnego gsasl_server_callback_retrieve() (b³±d aplikacji)
ro: Mecanismul SASL are nevoie de callback-ul gsasl_server_callback_retrieve() (eroare aplicaþie)

source: Failed to perform Unicode Normalization on string.
pl: Nie uda³o siê przeprowadziæ normalizacji unikodowej ³añcucha.
ro: Nu am reuºit sã realizez Normalizare Unicode pentru ºir.

source: Could not prepare internationalized (non-ASCII) string.
pl: Nie mo¿na przygotowaæ umiêdzynarodowionego ³añcucha (nie-ASCII).

source: SASL mechanism could not parse input
pl: Mechanizm SASL nie by³ w stanie przeanalizowaæ wej¶cia
ro: Mecanismul SASL nu a putut interpreta intrarea

source: Error authenticating user
pl: B³±d uwierzytelniania u¿ytkownika

source: Cannot get internal library handle (library error)
pl: Nie mo¿na uzyskaæ wewnêtrznego uchwytu biblioteki (b³±d biblioteki)
ro: Nu pot obþine handle-ul intern pentru bibliotecã (eroare bibliotecã)

source: Integrity error in application payload
pl: B³±d spójno¶ci w danych aplikacji
ro: Eroare integritate în încãrcãtura aplicaþiei

source: No more realms available (non-fatal)
pl: Nie ma wiêcej dostêpnych dziedzin (niekrytyczne)
ro: Nici un alt realm disponibil (non-fatal)

source: Client-side functionality not available in library (application error)
pl: Funkcjonalno¶æ strony klienta niedostêpna w bibliotece (b³±d aplikacji)
ro: Funcþionalitate de partea clientului nu este disponibilã în bibliotecã (eroare aplicaþie)

source: Server-side functionality not available in library (application error)
pl: Funkcjonalno¶æ strony serwera niedostêpna w bibliotece (b³±d aplikacji)
ro: Funcþionalitate de partea serverului nu este disponibilã în bibliotecã (eroare aplicaþie)

source: GSSAPI library could not deallocate memory in gss_release_buffer() in SASL library. This is a serious internal error.
pl: Biblioteka GSSAPI nie mog³a zwolniæ pamiêci w gss_release_buffer() w bibliotece SASL. To jest powa¿ny b³±d wewnêtrzny.
ro: Biblioteca GSSAPI nu a putut dealoca memorie în gss_release_buffer() în biblioteca SASL. Aceasta este o eroare internã serioasã.

source: GSSAPI library could not understand a peer name in gss_import_name() in SASL library. This is most likely due to incorrect service and/or hostnames.
pl: Biblioteka GSSAPI nie zrozumia³a nazwy partnera w gss_import_name() w bibliotece SASL. Najprawdopodobniej jest to spowodowane b³êdnymi nazwami us³ug i/lub hostów.

source: GSSAPI error in client while negotiating security context in gss_init_sec_context() in SASL library. This is most likely due insufficient credentials or malicious interactions.
pl: B³±d GSSAPI w kliencie podczas negocjacji kontekstu bezpieczeñstwa w gss_init_sec_context() w bibliotece SASL - najprawdopodobniej spowodowany niewystarczaj±cym uwierzytelnieniem lub z³ymi wp³ywami.
ro: Eroare GSSAPI în client în timpul negocierii contextului de securitate în gss_init_sec_context() în biblioteca SASL. Aceasta se datoreazã cel mai probabil datelor de acreditare insuficiente sau interacþiunii rãuvoitoare.

source: GSSAPI error in server while negotiating security context in gss_init_sec_context() in SASL library. This is most likely due insufficient credentials or malicious interactions.
pl: B³±d GSSAPI w serwerze podczas negocjacji kontekstu bezpieczeñstwa w gss_init_sec_context() w bibliotece SASL - najprawdopodobniej spowodowany niewystarczaj±cym uwierzytelnieniem lub z³ymi wp³ywami.
ro: Eroare GSSAPI în server în timpul negocierii contextului de securitate în gss_init_sec_context() în biblioteca SASL. Aceasta se datoreazã cel mai probabil datelor de acreditare insuficiente sau interacþiunii rãuvoitoare.

source: GSSAPI error while decrypting or decoding data in gss_unwrap() in SASL library. This is most likely due to data corruption.
pl: B³±d GSSAPI podczas odszyfrowywania lub odkodowywania danych w gss_unwrap() w bibliotece SASL - najprawdopodobniej spowodowany uszkodzeniem danych.
ro: Eroare GSSAPI în timpul decriptãrii sai decodãrii datelor în gss_unwrap() în biblioteca SASL. Aceasta se datoreazã cel mai probabil corupþiei datelor.

source: GSSAPI error while encrypting or encoding data in gss_wrap() in SASL library.
pl: B³±d GSSAPI podczas szyfrowania lub kodowania danych w gss_wrap() w bibliotece SASL.
ro: Eroare GSSAPI în timpul cifrãrii sau codãrii datelor în biblioteca SASL.

source: GSSAPI error acquiring credentials in gss_acquire_cred() in SASL library. This is most likely due to not having the proper Kerberos key available in /etc/krb5.keytab on the server.
pl: B³±d GSSAPI podczas otrzymywania uwierzytelnienia w gss_acquire_cred() w bibliotece SASL - najprawdopodobniej spowodowany brakiem odpowiedniego klucza Kerberosa w /etc/krb5.keytab na serwerze.
ro: Eroare GSSAPI la achiziþionare datelor de acreditare în gss_acquire_cred() în biblioteca SASL. Cauza cea mai probabilã este absenþa cheii Kerberos corespunzãtoare în /etc/krb5.keytab pe server.

source: GSSAPI error creating a display name denoting the client in gss_display_name() in SASL library. This is probably because the client supplied bad data.
pl: B³±d GSSAPI podczas tworzenia nazwy oznaczaj±cej klienta w gss_display_name() w bibliotece SASL - prawdopodobnie z powodu b³êdnych danych otrzymanych od klienta.

source: Other entity requested integrity or confidentiality protection in GSSAPI mechanism but this is currently not implemented.
pl: Inna jednostka za¿±da³a zabezpieczenia spójno¶ci lub poufno¶ci w mechanizmie GSSAPI, ale nie jest on aktualnie zaimplementowany.
ro: O altã entitate a cerut protecþia confidenþialitãþii sau integritaþii în mecanismul GSSAPI dar aceasta nu este implementatã deocamdatã.

source: The provided library handle was invalid (application error)
pl: B³êdny dostarczony uchwyt biblioteki (b³±d aplikacji)
ro: Handle-ul bibliotecii furnizat a fost invalid (eroare aplicaþie)

source: No callback specified by caller (application error).
pl: Wywo³uj±cy nie przekaza³ wywo³ania zwrotnego (b³±d aplikacji).
ro: Nici un callback specificat de apelant(eroare aplicaþie).

source: Authentication failed because the anonymous token was not provided.
pl: Uwierzytelnienie nie powiod³o siê, poniewa¿ nie przekazano anonimowego tokena.
ro: Autentificarea a eºuat pentru cã elementul (token) anonymous nu a fost furnizat.

source: Authentication failed because the authentication identity was not provided.
pl: Uwierzytelnienie nie powiod³o siê, poniewa¿ nie przekazano to¿samo¶ci uwierzytelnienia.
ro: Autentificarea a eºuat pentru cã identitatea de autentificare nu a fost furnizatã.

source: Authentication failed because the authorization identity was not provided.
pl: Uwierzytelnienie nie powiod³o siê, poniewa¿ nie przekazano to¿samo¶ci autoryzacji.
ro: Autentificarea a eºuat pentru cã identitatea de autorizare nu a fost furnizatã.

source: Authentication failed because the password was not provided.
pl: Uwierzytelnienie nie powiod³o siê, poniewa¿ nie przekazano has³a.
ro: Autentificarea a eºuat pentru cã nu a fost furnizatã parola.

source: Authentication failed because the passcode was not provided.
pl: Uwierzytelnienie nie powiod³o siê, poniewa¿ nie przekazano tajnego kodu.
ro: Autentificarea a eºuat pentru cã nu a fost furnizat passcode-ul.

source: Authentication failed because the pin code was not provided.
pl: Uwierzytelnienie nie powiod³o siê, poniewa¿ nie przekazano kodu PIN.
ro: Autentificarea a eºuat pentru cã nu a fost furnizat codul pin.

source: Authentication failed because the service name was not provided.
pl: Uwierzytelnienie nie powiod³o siê, poniewa¿ nie przekazano nazwy us³ugi.
ro: Autentificarea a eºuat pentru cã nu a fost furnizat numele serviciului.

source: Authentication failed because the host name was not provided.
pl: Uwierzytelnienie nie powiod³o siê, poniewa¿ nie przekazano nazwy hosta.
ro: Autentificarea a eºuat pentru cã nu a fost furnizat numele host-ului.

source: Libgsasl unknown error
pl: Nieznany b³±d libgsasl
ro: Eroare libgsasl necunoscutã
