Repository: scs/uclinux
Catalog: lib/libgsasl/libgsasl-0.2.21/po/*.po
Languages: nl

source: Libgsasl success
nl: Libgsasl succes

source: SASL mechanism needs more data
nl: SASL-methode vereist meer gegevens

source: Unknown SASL mechanism
nl: Onbekende SASL-methode

source: SASL mechanism called too many times
nl: SASL-methode te vaak aangeroepen

source: Memory allocation error in SASL library
nl: Geheugentoewijzingsfout in SASL-bibliotheek

source: Base 64 coding error in SASL library
nl: Base64 coderingsfout in SASL-bibliotheek

source: Low-level crypto error in SASL library
nl: Cryptografiefout op laag niveau in SASL-bibliotheek

source: GSSAPI library could not deallocate memory in gss_release_buffer() in SASL library. This is a serious internal error.
nl: GSSAPI-bibliotheek kon geheugen niet vrijgeven in gss_release_buffer() in SASL-bibliotheek. Dit is een serieuze interne fout.

source: GSSAPI error in client while negotiating security context in gss_init_sec_context() in SASL library. This is most likely due insufficient credentials or malicious interactions.
nl: GSSAPI fout in client bij onderhandelen over veiligheidscontext in gss_init_sec_context() in SASL-bibliotheek. Dit komt waarschijnlijk door onvoldoende identificatiegegevens of onjuiste gegevensuitwisselingen.

source: GSSAPI error in server while negotiating security context in gss_init_sec_context() in SASL library. This is most likely due insufficient credentials or malicious interactions.
nl: GSSAPI fout in server bij onderhandelen over veiligheidscontext in gss_init_sec_context() in SASL-bibliotheek. Dit komt waarschijnlijk door onvoldoende identificatiegegevens of onjuiste gegevensuitwisselingen.

source: GSSAPI error while decrypting or decoding data in gss_unwrap() in SASL library. This is most likely due to data corruption.
nl: GSSAPI fout bij decoderen van gegevens in gss_unwrap() in SASL-bibliotheek. Dit komt waarschijnlijk door beschadigde gegevens.

source: GSSAPI error while encrypting or encoding data in gss_wrap() in SASL library.
nl: GSSAPI fout bij coderen van gegevens in gss_wrap() in SASL-bibliotheek.

source: GSSAPI error acquiring credentials in gss_acquire_cred() in SASL library. This is most likely due to not having the proper Kerberos key available in /etc/krb5.keytab on the server.
nl: GSSAPI fout bij verkrijgen identificatiegegevens in gss_acquire_cred() in SASL-bibliotheek. Dit komt waarschijnlijk door het niet hebben van een juiste Kerberos-sleutel in /etc/krb5.keytab op de server.

source: GSSAPI error creating a display name denoting the client in gss_display_name() in SASL library. This is probably because the client supplied bad data.
nl: GSSAPI-fout bij maken weergavenaam voor client in gss_display_name() in SASL-bibliotheek. Waarschijnlijk heeft de client slechte gegevens opgegeven.

source: Other entity requested integrity or confidentiality protection in GSSAPI mechanism but this is currently not implemented.
nl: Een andere entiteit verzocht om bescherming van integriteit of vertrouwelijkheid in GSSAPI-methode maar dat is nog niet geïmplementeerd.

source: SASL mechanism could not parse input
nl: SASL-methode kon invoer niet verwerken

source: Error authenticating user
nl: Fout bij authentificatie van gebruiker

source: Integrity error in application payload
nl: Integriteitsfout in pakketlading toepassing

source: Client-side functionality not available in library (application error)
nl: Client-kant functionaliteit niet beschikbaar in bibliotheek (toepassingsfout)

source: Server-side functionality not available in library (application error)
nl: Server-kant functionaliteit niet beschikbaar in bibliotheek (toepassingsfout)

source: No callback specified by caller (application error).
nl: Geen terugaanroep opgegeven door aanroeper (toepassingsfout).

source: Authentication failed because the anonymous token was not provided.
nl: Authentificatie mislukt omdat geen anoniem token is gegeven.

source: Authentication failed because the authentication identity was not provided.
nl: Authentificatie mislukt omdat geen authentificatie identiteit is gegeven.

source: Authentication failed because the authorization identity was not provided.
nl: Authentificatie mislukt omdat geen authorisatie identiteit is gegeven

source: Authentication failed because the password was not provided.
nl: Authentificatie mislukt omdat geen wachtwoord is gegeven.

source: Authentication failed because the passcode was not provided.
nl: Authentificatie mislukt omdat geen wachtwoord is gegeven.

source: Authentication failed because the pin code was not provided.
nl: Authentificatie mislukt omdat geen pincode is gegeven.

source: Authentication failed because the service name was not provided.
nl: Authentificatie mislukt omdat geen dienstnaam is gegeven.

source: Authentication failed because the host name was not provided.
nl: Authentificatie mislukt omdat geen hostnaam is gegeven.

source: Could not prepare internationalized (non-ASCII) string.
nl: Kon geïnternationaliseerde (niet-ASCII) tekst niet voorbereiden.

source: SASL function needs larger buffer (internal error)
nl: SASL-functie vereist grotere buffer (interne fout)

source: Could not open file in SASL library
nl: Kon bestand niet openen in SASL-bibliotheek

source: Could not close file in SASL library
nl: Kon bestand niet sluiten in SASL-bibliotheek

source: Cannot get internal library handle (library error)
nl: Kan interne-bibliotheek-handvat niet opvragen (bibliotheekfout)

source: SASL mechanism needs gsasl_client_callback_anonymous() callback (application error)
nl: SASL-methode vereist gsasl_client_callback_anonymous() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_client_callback_password() callback (application error)
nl: SASL-methode vereist gsasl_client_callback_password() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_client_callback_passcode() callback (application error)
nl: SASL-methode vereist gsasl_client_callback_passcode() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_client_callback_pin() callback (application error)
nl: SASL-methode vereist gsasl_client_callback_pin() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_client_callback_authorization_id() callback (application error)
nl: SASL-methode vereist gsasl_client_callback_authorization_id() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_client_callback_authentication_id() callback (application error)
nl: SASL-methode vereist gsasl_client_callback_authentication_id() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_client_callback_service() callback (application error)
nl: SASL-methode vereist gsasl_client_callback_service() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_server_callback_validate() callback (application error)
nl: SASL-methode vereist gsasl_server_callback_validate() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_server_callback_cram_md5() callback (application error)
nl: SASL-methode vereist gsasl_server_callback_cram_md5() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_server_callback_digest_md5() callback (application error)
nl: SASL-methode vereist gsasl_server_callback_digest_md5() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_server_callback_anonymous() callback (application error)
nl: SASL-methode vereist gsasl_server_callback_anonymous() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_server_callback_external() callback (application error)
nl: SASL-methode vereist gsasl_server_callback_external() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_server_callback_realm() callback (application error)
nl: SASL-methode vereist gsasl_server_callback_realm() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_server_callback_securid() callback (application error)
nl: SASL-methode vereist gsasl_server_callback_securid() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_server_callback_service() callback (application error)
nl: SASL-methode vereist gsasl_server_callback_service() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_server_callback_gssapi() callback (application error)
nl: SASL-methode vereist gsasl_server_callback_gssapi() terugaanroep (toepassingsfout)

source: SASL mechanism needs gsasl_server_callback_retrieve() callback (application error)
nl: SASL-methode vereist gsasl_server_callback_retrieve() terugaanroep (toepassingsfout)

source: Failed to perform Unicode Normalization on string.
nl: Unicode-normalisatie mislukt op tekst.

source: The provided library handle was invalid (application error)
nl: Het gegeven bibliotheekhandvat was ongeldig (toepassingsfout)

source: Libgsasl unknown error
nl: Onbekende Libgsasl-fout
